cf/DataProcessors/InfobaseObjectsMapping.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>InfobaseObjectsMapping</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DataSuccessfullyImported</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReceiverTableName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TableSourceObjectTypeName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeMessageFileName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SearchFieldsOfReceiverTable</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReceiverTableFields</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ListOfUsedFields</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TableFieldList</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SourceTypeAsString</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReceiverTypeAsString</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InfobaseNode</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ThisIsObjectDeletion</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>TableOfUnapprovedLinks</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>UniqueReceiverHandle</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UniqueSourceHandle</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SourceType</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ReceiverType</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>TableOfAutomaticallyMappedObjects</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Check</Name>
							<Comment>Yes - use mapping, No - don't use the mapping</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UniqueReceiverHandle</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UniqueSourceHandle</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SourceType</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ReceiverType</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ReceiverField1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ReceiverField2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ReceiverField3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ReceiverField4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ReceiverField5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SourceField1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SourceField2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SourceField3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SourceField4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SourceField5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ReceiverPictureIndex</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SourcePictureIndex</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SortTable</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>FieldName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Use</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SortDirection</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/DataProcessors/InfobaseObjectsMapping/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ServiceProgramInterface

// For an internal use.
//
Procedure PerformMappingOfObjects(Parameters, TemporaryStorageAddress) Export
	
	PutToTempStorage(ResultMappingObjects(Parameters), TemporaryStorageAddress);
	
EndProcedure

// For an internal use.
//
Function ResultMappingObjects(Parameters) Export
	
	MappingObjects = DataProcessors.InfobaseObjectsMapping.Create();
	DataExchangeServer.ImportObjectContext(Parameters.ObjectContext, MappingObjects);
	
	Cancel = False;
	
	// Apply unapproved connection table to database.
	If Parameters.FormAttributes.OnlyApplyTableUnapprovedRecords Then
		
		MappingObjects.ApplyTableOfUnapprovedRecords(Cancel);
		
		If Cancel Then
			Raise NStr("en='Errors occurred when mapping objects.';ru='Возникли ошибки в процессе сопоставления объектов.'");
		EndIf;
		
		Return Undefined;
	EndIf;
	
	// Apply the results of automatic object mapping which are received by user.
	If Parameters.FormAttributes.ApplyResultOfAutomaticMapping Then
		
		// Add unapproved connection table.
		For Each TableRow IN Parameters.TableOfAutomaticallyMappedObjects Do
			
			FillPropertyValues(MappingObjects.TableOfUnapprovedLinks.Add(), TableRow);
			
		EndDo;
		
	EndIf;
	
	// Apply unapproved connection table to database.
	If Parameters.FormAttributes.ApplyTableOfUnapprovedRecords Then
		
		MappingObjects.ApplyTableOfUnapprovedRecords(Cancel);
		
		If Cancel Then
			Raise NStr("en='Errors occurred when mapping objects.';ru='Возникли ошибки в процессе сопоставления объектов.'");
		EndIf;
		
	EndIf;
	
	// Get mapping table.
	MappingObjects.PerformMappingOfObjects(Cancel);
	
	If Cancel Then
		Raise NStr("en='Errors occurred when mapping objects.';ru='Возникли ошибки в процессе сопоставления объектов.'");
	EndIf;
	
	Result = New Structure;
	Result.Insert("ObjectsCountInSource",       MappingObjects.ObjectsCountInSource());
	Result.Insert("ObjectsCountInReceiver",       MappingObjects.ObjectsCountInReceiver());
	Result.Insert("NumberOfObjectsMapped",   MappingObjects.NumberOfObjectsMapped());
	Result.Insert("UnmappedObjectsCount", MappingObjects.UnmappedObjectsCount());
	Result.Insert("ObjectsMappingPercent",       MappingObjects.ObjectsMappingPercent());
	Result.Insert("MappingTable",               MappingObjects.MappingTable());
	
	Result.Insert("ObjectContext", DataExchangeServer.GetObjectContext(MappingObjects));
	
	Return Result;
EndFunction

// For an internal use.
//
Procedure RunAutomaticObjectMapping(Parameters, TemporaryStorageAddress) Export
	
	PutToTempStorage(ResultOfAutomaticMappingObjects(Parameters), TemporaryStorageAddress);
	
EndProcedure

// For an internal use.
//
Function ResultOfAutomaticMappingObjects(Parameters) Export
	
	MappingObjects = DataProcessors.InfobaseObjectsMapping.Create();
	DataExchangeServer.ImportObjectContext(Parameters.ObjectContext, MappingObjects);
	
	// Define property  "UsedFieldList".
	MappingObjects.ListOfUsedFields.Clear();
	CommonUseClientServer.FillPropertyCollection(Parameters.FormAttributes.ListOfUsedFields, MappingObjects.ListOfUsedFields);
	
	// Define property "TableFieldList".
	MappingObjects.TableFieldList.Clear();
	CommonUseClientServer.FillPropertyCollection(Parameters.FormAttributes.TableFieldList, MappingObjects.TableFieldList);
	
	// Import unapproved connection table.
	MappingObjects.TableOfUnapprovedLinks.Load(Parameters.TableOfUnapprovedLinks);
	
	Cancel = False;
	
	// Get automatic object mapping table.
	MappingObjects.RunAutomaticObjectMapping(Cancel, Parameters.FormAttributes.MappingFieldList);
	
	If Cancel Then
		Raise NStr("en='Errors occurred when mapping objects automatically.';ru='Возникли ошибки в процессе автоматического сопоставления объектов.'");
	EndIf;
	
	Result = New Structure;
	Result.Insert("EmptyResult", MappingObjects.TableOfAutomaticallyMappedObjects.Count() = 0);
	Result.Insert("ObjectContext", DataExchangeServer.GetObjectContext(MappingObjects));
	
	Return Result;
EndFunction

#EndRegion

#EndIf
